; domain
;; This is a plain STRIPS formulation of the standard Logistics domain.

;; In this domain, there are six different types of objects: "object"
;; (the packages to be transported), "truck", "airplane" and their
;; common supertype "vehicle", "location" and the subtype "airport",
;; and finally "city". Types are defined by static (in the sense that
;; there are no operators that change their truth value) unary predicates.
;; The types of objects in a problem instance must be defined by including
;; the appropriate typing predicates in the initial state.

;; A binary static predicate called "loc" describes the topology of the
;; problem instance: "(loc ?l ?c)" is true iff the location ?l is in city
;; ?c.

(define (domain logistics)
  (:requirements :strips)
  (:predicates

  ;; Static predicates:
  (object ?o) (smallpackage ?sp) (mediumpackage ?mp) (largepackage ?lp)
  (truck ?t) (airplane ?p) (ship ?s) (vehicle ?v)
  (location ?l) (airport ?a) (city ?c) (loc ?l ?c) (bay ?b)

  ;; Non-static predicates:
  (at ?x ?l) ;; ?x (package or vehicle) is at location ?l
  (in ?p ?v) ;; package ?p is in vehicle ?v
  )

  ;; Actions for loading and unloading packages.
  ;; By declaring all trucks and airplanes to be also "vehicle", we
  ;; can use the same load/unload operator for both (otherwise we
  ;; would need one for each subtype of vehicle).
    
  (:action load
  :parameters (?sp ?v ?l)
  :precondition (and (smallpackage ?sp) (vehicle ?v) (location ?l)
    		(at ?v ?l) (at ?sp ?l))
  :effect (and (in ?sp ?v) (not (at ?sp ?l))))

  (:action unload
  :parameters (?sp ?v ?l)
  :precondition (and (smallpackage ?sp) (vehicle ?v) (location ?l)
	       (at ?v ?l) (in ?sp ?v))
  :effect (and (at ?sp ?l) (not (in ?sp ?v))))

  ;; --- Our load and unload actions for different vehicles whom can take different packages. ---

  (:action loadmediumpackage
  :parameters (?mp ?p ?l)
  :precondition (and (mediumpackage ?mp) (airplane ?p) (location ?l)
 	   	(at ?p ?l) (at ?mp ?l))
  :effect (and (in ?mp ?p) (not (at ?mp ?l))))

  (:action unloadmediumpackage
  :parameters (?mp ?p ?l)
  :precondition (and (mediumpackage ?mp) (airplane ?p) (location ?l)
	       (at ?p ?l) (in ?mp ?p))
  :effect (and (at ?mp ?l) (not (in ?mp ?p))))

  (:action loadlargepackage
  :parameters (?lp ?s ?l)
  :precondition (and (largepackage ?lp) (ship ?s) (location ?l)
 	   	(at ?s ?l) (at ?lp ?l))
  :effect (and (in ?lp ?s) (not (at ?lp ?l))))

  (:action unloadlargepackage
  :parameters (?lp ?s ?l)
  :precondition (and (largepackage ?lp) (ship ?s) (location ?l)
	       (at ?s ?l) (in ?lp ?s))
  :effect (and (at ?lp ?l) (not (in ?lp ?s))))

  ;;-------------------------------------------------------------------
  (:action loadtruck
  :parameters (?o ?v ?l)
  :precondition (and (object ?o) (truck ?v) (location ?l)
    		(at ?v ?l) (at ?o ?l))
  :effect (and (in ?o ?v) (not (at ?o ?l))))

  (:action unloadtruck
  :parameters (?o ?v ?l)
  :precondition (and (object ?o) (truck ?v) (location ?l)
	       (at ?v ?l) (in ?o ?v))
  :effect (and (at ?o ?l) (not (in ?o ?v))))


  ;; -------------------------------- end of loads / unloads ------------------------

  ;; Drive a truck between two locations in the same city.
  ;; By declaring all locations, including airports, to be of type
  ;; "location", we can use only one driving operator (otherwise,
  ;; we would again need one for each case, i.e. one for from-location-
  ;; to-airport, one for from-location-to-location, etc. Very
  ;; unnecessay).
  (:action drive
    :parameters (?t ?l1 ?l2 ?c)
    :precondition (and (truck ?t) (location ?l1) (location ?l2) (city ?c)
		       (at ?t ?l1) (loc ?l1 ?c) (loc ?l2 ?c))
    :effect (and (at ?t ?l2) (not (at ?t ?l1)))) 

  ;; Fly an airplane between two airports.
  (:action fly
    :parameters (?p ?a1 ?a2)
    :precondition (and (airplane ?p) (airport ?a1) (airport ?a2)
		       (at ?p ?a1))
    :effect (and (at ?p ?a2) (not (at ?p ?a1))))

  ;; Sail an ship between two bays
  (:action sail
     :parameters (?s ?b1 ?b2)
     :precondition (and (ship ?s) (bay ?b1) (bay ?b2)  
     		   	(at ?s ?b1))
     :effect (and (at ?s ?b2) (not (at ?s ?b1))))	
  )

; problem
(define (problem C4_4)
  (:domain logistics)
  (:objects packet1 packet2 packet3 packet4 packet5 
  	    truck1 truck2 truck3 truck4 truck5
	    airplane1 
	    ship1 ;; Our ships 
            office1 office2 office3 office4 office5
	    airport1 airport2 airport3 airport4 
	    bay1 bay2 bay3 ;; Our bays
	    city1 city2 city3 city4 city5
	    smallpackage mediumpackage largepackage)

  (:init (smallpackage packet1)
  	 (object packet1) 

  	 (smallpackage packet2)
	 (object packet2)

	 (smallpackage packet3)
	 (object packet3)

  	 (smallpackage packet4)
	 (object packet4)

	 (largepackage packet5)
	 (object packet5)
         
	 (truck truck1) (truck truck2) (truck truck3) (truck truck4) (truck truck5)
         (vehicle truck1) (vehicle truck2) (vehicle truck3) (vehicle truck4) (vehicle truck5)
         
	 (airplane airplane1) (vehicle airplane1)
	 
	 (ship ship1) (vehicle ship1) ;; We got ships bitches
	 
	 (location office1) (location office2) (location office3) (location office4) (location office5)
 
	 (location airport1) (location airport2) (location airport3) (location airport4) 

	 (location bay1) (location bay2) (location bay3) ;; Our bay loc-declaration

	 (bay bay1) (bay bay2) (bay bay3) ;; Our bay declarations
	 
	 (airport airport1) (airport airport2) (airport airport3) (airport airport4)

         (city city1) (city city2) (city city3) (city city4) (city city5)

         (loc office1 city1) (loc airport1 city1) (loc bay1 city1)
	 
	 (loc office2 city2) (loc airport2 city2) (loc bay2 city2) 

	 (loc office3 city3) (loc airport3 city3)
         
	 (loc office4 city4) (loc airport4 city4)
	 
	 (loc office5 city5) (loc bay3 city5)

         (at packet1 office1) (at packet2 office2) (at packet3 office3) (at packet4 office4) (at packet5 office1)

	 (at truck1 airport1) (at truck2 airport2) 

	 (at truck3 office3) (at truck4 office4) (at truck5 office5)

	 (at airplane1 airport1)

	 (at ship1 bay1))

  (:goal  (and (at packet1 office2) (at packet2 office3)
	      (at packet3 office4) (at packet4 office1)
	      (at packet5 office5) ))
	      )

; plan
1. (load packet4 truck4 office4)
   deleted: (at packet4 office4)
   added: (in packet4 truck4)
   goals met: 0 of 5
2. (load packet3 truck3 office3)
   deleted: (at packet3 office3)
   added: (in packet3 truck3)
   goals met: 0 of 5
3. (drive truck4 office4 airport4 city4)
   deleted: (at truck4 office4)
   added: (at truck4 airport4)
   goals met: 0 of 5
4. (unload packet4 truck4 airport4)
   deleted: (in packet4 truck4)
   added: (at packet4 airport4)
   goals met: 0 of 5
5. (drive truck3 office3 airport3 city3)
   deleted: (at truck3 office3)
   added: (at truck3 airport3)
   goals met: 0 of 5
6. (unload packet3 truck3 airport3)
   deleted: (in packet3 truck3)
   added: (at packet3 airport3)
   goals met: 0 of 5
7. (drive truck2 airport2 office2 city2)
   deleted: (at truck2 airport2)
   added: (at truck2 office2)
   goals met: 0 of 5
8. (load packet2 truck2 office2)
   deleted: (at packet2 office2)
   added: (in packet2 truck2)
   goals met: 0 of 5
9. (drive truck2 office2 airport2 city2)
   deleted: (at truck2 office2)
   added: (at truck2 airport2)
   goals met: 0 of 5
10. (unload packet2 truck2 airport2)
   deleted: (in packet2 truck2)
   added: (at packet2 airport2)
   goals met: 0 of 5
11. (drive truck1 airport1 office1 city1)
   deleted: (at truck1 airport1)
   added: (at truck1 office1)
   goals met: 0 of 5
12. (loadtruck packet5 truck1 office1)
   deleted: (at packet5 office1)
   added: (in packet5 truck1)
   goals met: 0 of 5
13. (load packet1 truck1 office1)
   deleted: (at packet1 office1)
   added: (in packet1 truck1)
   goals met: 0 of 5
14. (drive truck1 office1 airport1 city1)
   deleted: (at truck1 office1)
   added: (at truck1 airport1)
   goals met: 0 of 5
15. (unload packet1 truck1 airport1)
   deleted: (in packet1 truck1)
   added: (at packet1 airport1)
   goals met: 0 of 5
16. (load packet1 airplane1 airport1)
   deleted: (at packet1 airport1)
   added: (in packet1 airplane1)
   goals met: 0 of 5
17. (drive truck1 airport1 bay1 city1)
   deleted: (at truck1 airport1)
   added: (at truck1 bay1)
   goals met: 0 of 5
18. (unloadtruck packet5 truck1 bay1)
   deleted: (in packet5 truck1)
   added: (at packet5 bay1)
   goals met: 0 of 5
19. (drive truck1 bay1 airport1 city1)
   deleted: (at truck1 bay1)
   added: (at truck1 airport1)
   goals met: 0 of 5
20. (loadlargepackage packet5 ship1 bay1)
   deleted: (at packet5 bay1)
   added: (in packet5 ship1)
   goals met: 0 of 5
21. (sail ship1 bay1 bay3)
   deleted: (at ship1 bay1)
   added: (at ship1 bay3)
   goals met: 0 of 5
22. (unloadlargepackage packet5 ship1 bay3)
   deleted: (in packet5 ship1)
   added: (at packet5 bay3)
   goals met: 0 of 5
23. (drive truck5 office5 bay3 city5)
   deleted: (at truck5 office5)
   added: (at truck5 bay3)
   goals met: 0 of 5
24. (loadtruck packet5 truck5 bay3)
   deleted: (at packet5 bay3)
   added: (in packet5 truck5)
   goals met: 0 of 5
25. (drive truck5 bay3 office5 city5)
   deleted: (at truck5 bay3)
   added: (at truck5 office5)
   goals met: 0 of 5
26. (unloadtruck packet5 truck5 office5)
   deleted: (in packet5 truck5)
   added: (at packet5 office5)
   goals met: 1 of 5
27. (fly airplane1 airport1 airport2)
   deleted: (at airplane1 airport1)
   added: (at airplane1 airport2)
   goals met: 1 of 5
28. (load packet2 airplane1 airport2)
   deleted: (at packet2 airport2)
   added: (in packet2 airplane1)
   goals met: 1 of 5
29. (unload packet1 airplane1 airport2)
   deleted: (in packet1 airplane1)
   added: (at packet1 airport2)
   goals met: 1 of 5
30. (load packet1 truck2 airport2)
   deleted: (at packet1 airport2)
   added: (in packet1 truck2)
   goals met: 1 of 5
31. (drive truck2 airport2 office2 city2)
   deleted: (at truck2 airport2)
   added: (at truck2 office2)
   goals met: 1 of 5
32. (unload packet1 truck2 office2)
   deleted: (in packet1 truck2)
   added: (at packet1 office2)
   goals met: 2 of 5
33. (fly airplane1 airport2 airport3)
   deleted: (at airplane1 airport2)
   added: (at airplane1 airport3)
   goals met: 2 of 5
34. (load packet3 airplane1 airport3)
   deleted: (at packet3 airport3)
   added: (in packet3 airplane1)
   goals met: 2 of 5
35. (unload packet2 airplane1 airport3)
   deleted: (in packet2 airplane1)
   added: (at packet2 airport3)
   goals met: 2 of 5
36. (load packet2 truck3 airport3)
   deleted: (at packet2 airport3)
   added: (in packet2 truck3)
   goals met: 2 of 5
37. (drive truck3 airport3 office3 city3)
   deleted: (at truck3 airport3)
   added: (at truck3 office3)
   goals met: 2 of 5
38. (unload packet2 truck3 office3)
   deleted: (in packet2 truck3)
   added: (at packet2 office3)
   goals met: 3 of 5
39. (fly airplane1 airport3 airport4)
   deleted: (at airplane1 airport3)
   added: (at airplane1 airport4)
   goals met: 3 of 5
40. (load packet4 airplane1 airport4)
   deleted: (at packet4 airport4)
   added: (in packet4 airplane1)
   goals met: 3 of 5
41. (unload packet3 airplane1 airport4)
   deleted: (in packet3 airplane1)
   added: (at packet3 airport4)
   goals met: 3 of 5
42. (load packet3 truck4 airport4)
   deleted: (at packet3 airport4)
   added: (in packet3 truck4)
   goals met: 3 of 5
43. (drive truck4 airport4 office4 city4)
   deleted: (at truck4 airport4)
   added: (at truck4 office4)
   goals met: 3 of 5
44. (unload packet3 truck4 office4)
   deleted: (in packet3 truck4)
   added: (at packet3 office4)
   goals met: 4 of 5
45. (fly airplane1 airport4 airport1)
   deleted: (at airplane1 airport4)
   added: (at airplane1 airport1)
   goals met: 4 of 5
46. (unload packet4 airplane1 airport1)
   deleted: (in packet4 airplane1)
   added: (at packet4 airport1)
   goals met: 4 of 5
47. (load packet4 truck1 airport1)
   deleted: (at packet4 airport1)
   added: (in packet4 truck1)
   goals met: 4 of 5
48. (drive truck1 airport1 office1 city1)
   deleted: (at truck1 airport1)
   added: (at truck1 office1)
   goals met: 4 of 5
49. (unload packet4 truck1 office1)
   deleted: (in packet4 truck1)
   added: (at packet4 office1)
   goals met: 5 of 5
